#ifndef __GLOBAL_h_
#define __GLOBAL_h_

#define LED P2

//---重定义关键词---//
#ifndef uchar
#define uchar unsigned char
#endif
#ifndef uint 
#define uint unsigned int
#endif
#ifndef ulong
#define ulong unsigned long

bit Ulsign=0;               //是否启动测距模块
bit REflag=0;               //用来判断是否存储音乐
//****************************************************************************//
uchar Diao=0,EXT=7,ALL=0;
//用来存放定时器初值
//******************************LED音符显示************************************
/*sbit LSA=P1^3;
sbit LSB=P1^4;
sbit LSC=P1^5;*/
//******************************按键定义***************************************//
sbit K1=P2^0;
sbit K2=P2^1;
sbit K3=P2^2;
sbit K4=P2^3;
//********************************************************************************
//显示0~F的值和P,U,gama,y,H,L,-,全亮,全灭,^,_*/
/*uchar code smgshow[]={0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,
				            	0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71,
                      0x73,0x3e,0x31,0x6e,0x76,0x38,0x40,0xff,
                      0x00,0x01,0x08};*/
//端口单引脚触发低电平,LED流水灯
//uchar code Tab[]={0xfe,0xfd,0xfb,0xf7,0xef,0xdf,0xbf,0x7f};

//*****************************************************************************************************
/*C调各音符频率,#表升半阶
uint code ToneFre[]={
          262,277#,294,311#,330,349,370#,392,415#,440,466#,494,523,554#,578,622#,659,698,
          740#,748,831#,880,932#,988,1046,1109#,1175,1245#,1318,1397,1480#,1568,1661#,1760,1865#,1967};
uint code ToneJPM[]={ 65535,//低中高三种音符
	        63628,63731,63835,63928,64021,64103,64185,64260,64331,
          64400,64463,64524,64580,64633,64684,64732,64777,64820,
          64860,64898,64934,64968,64994,65030,65058,65085,65110,
          65134,65157,65178,65198,65217,65235,65252,65268,65283};
*/
uint code Tonetab[]={ 
	        65535,                                              //低中高三种音符
					63628,63835,64021,64103,64260,64400,64524,
					64580,64684,64777,64820,64898,64968,65030,
					65058,65110,65157,65178,65217,65252,65283,          //升半阶共15个
					63731,63928,64185,64331,64463,64633,64732,
					64860,64934,64994,65085,65134,65198,65235,
	        65268     };
//******************************==函数列表==***************************************
void delayus(uint us);
void delayms(uint ms);
void LEDisp(uchar index);
/*******************************************************************************
* 函数功能: 以10us为单位延时
*******************************************************************************/
void delayus(uint us)
{
	while(us--);	
}
//******************************==ms级延时函数==***********************************
void delayms(uint ms)
{
	uint i;
	while(ms--)
	{for(i=130;i>0;i--);}
}	
/*******************************************************************************
* 函 数 名  : void SMGshow(uchar index) 
* 函数功能	: 数码管动态扫描函数
*******************************************************************************/
/*void SMGshow(uchar index)     //七个音符
{
	LSA=LSB=LSC=0;
	switch(index%8)	 //位选,选择要点亮的数码管
		{
			case(0):
				LSA=0;LSB=0;LSC=0; break;//显示第0位
			case(1):
				LSA=1;LSB=0;LSC=0; break;//显示第1位
			case(2):
				LSA=0;LSB=1;LSC=0; break;//显示第2位
			case(3):
				LSA=1;LSB=1;LSC=0; break;//显示第3位
			case(4):
				LSA=0;LSB=0;LSC=1; break;//显示第4位
			case(5):
				LSA=1;LSB=0;LSC=1; break;//显示第5位
			case(6):
				LSA=0;LSB=1;LSC=1; break;//显示第6位
			case(7):
				LSA=1;LSB=1;LSC=1; break;//显示第7位	
		} 
}*/
#endif